#!/usr/bin/env bash
# chaves.sh - Breve descrição
#
# Site:       https://seusite.com.br
# Autor:      Seu nome
# Manutenção: Seu nome ou outro
#
# ------------------------------------------------------------------------ #
#  Irá extrair usuários do os 
#
#  Exemplos:
#      $ ./chaves.sh -s -m
#      Neste exemplo o script ficará em maiúsculo e em ordem alfabética
# ------------------------------------------------------------------------ #
# Histórico:
#
#   v1.0 18/08/2018, Autor da mudança:
#       - O que mudou?
# ------------------------------------------------------------------------ #
# Testado em:
#   bash 5.1.4
# ------------------------------------------------------------------------ 
# ------------------------------- VARIÁVEIS ----------------------------------------- #

USUARIOS="$(cat /etc/passwd | cut -d : -f 1)"

MENSAGEM_USER="
    $0 - [OPÇÕES]

    -h  - Help
    -v  - Versão
    -s  - Ordernar Saída
"
VERSAO="v1.0"
# ------------------------------------------------------------------------ #



# ------------------------------- TESTES ----------------------------------------- #

# 

# ------------------------------------------------------------------------ #



# ------------------------------- EXECUÇÃO ----------------------------------------- #
if ["$1" = "-h"]; then
    echo "$MENSAGEM_USER" && exit 0
fi
